#include "pch.h"

#include "Engine/GameplayStatics/Header/GameplayStatics.h"
#include "Engine/HTTP/Header/HTTP.h"
#include "Engine/Kismet/Header/Kismet.h"
#include "Engine/NetDriver/Header/NetDriver.h"
#include "FortniteGame/AbilitySystemComponent/Header/AbilitySystemComponent.h"
#include "FortniteGame/BuildingGameplayActor/Header/BuildingGameplayActor.h"
#include "FortniteGame/BuildingSMActor/Header/BuildingSMActor.h"
#include "FortniteGame/FortAthenaCreativePortal/Header/FortAthenaCreativePortal.h"
#include "FortniteGame/FortAthenaMutator/Header/FortAthenaMutator.h"
#include "FortniteGame/FortGameMode/Header/FortGameMode.h"
#include "FortniteGame/FortGameSessionDedicated/Header/FortGameSessionDedicated.h"
#include "FortniteGame/FortLootPackage/Header/FortLootPackage.h"
#include "FortniteGame/FortMinigameSettingsBuilding/Header/FortMinigameSettingsBuilding.h"
#include "FortniteGame/FortPlayerController/Header/FortPlayerController.h"
#include "FortniteGame/FortProjectileBase/Header/FortProjectileBase.h"
#include "FortniteGame/FortQuestManager/Header/FortQuestManager.h"
#include "FortniteGame/FortSafeZoneIndicator/Header/FortSafeZoneIndicator.h"
#include "FortniteGame/GAB_InterrogatePlayer/Header/GAB_InterrogatePlayer.h"
#include "Neon/Config.h"
#include "Neon/Finder/Header/Finder.h"
#include "Neon/Nexa/Echo/Echo.h"
#include "Neon/Runtime/Runtime.h"
#include "Neon/TickService/FortAthenaAI/Header/FortAthenaAI.h"

// I didnt do shit (@obsessedtech)


			!strstr(FunctionName.c_str(), "OnComponentHit_Event_0") &&
			!strstr(FunctionName.c_str(), "HandleSimulatingComponentHit") &&
			!strstr(FunctionName.c_str(), "CBGA_GreenGlop_WithGrav_C") &&
			!strstr(FunctionName.c_str(), "WarmupCountdownEndTimeUpdated") &&
			!strstr(FunctionName.c_str(), "BP_CanInteract") &&
			!strstr(FunctionName.c_str(), "AthenaHitPointBar_C") &&
			!strstr(FunctionName.c_str(), "ServerFireAIDirectorEvent") &&
			!strstr(FunctionName.c_str(), "BlueprintThreadSafeUpdateAnimation") &&
			!strstr(FunctionName.c_str(), "On Amb Zap Spawn") &&
			!strstr(FunctionName.c_str(), "ServerSetPlayerCanDBNORevive") &&
			!strstr(FunctionName.c_str(), "BGA_Petrol_Pickup_C") &&
			!strstr(FunctionName.c_str(), "GetMutatorsForContextActor") &&
			!strstr(FunctionName.c_str(), "GetControlRotation") &&
			!strstr(FunctionName.c_str(), "K2_GetComponentLocation") &&
			!strstr(FunctionName.c_str(), "MoveFromOffset__UpdateFunc") &&
			!strstr(FunctionName.c_str(), "BlueprintGetAllHighlightableComponents") &&
			!strstr(FunctionName.c_str(), "ServerTriggerCombatEvent") &&
			!strstr(FunctionName.c_str(), "SpinCubeTimeline__UpdateFunc") &&
			!strstr(FunctionName.c_str(), "GetTextValue") &&
			!strstr(FunctionName.c_str(), "OnActorBump") &&
			!strstr(FunctionName.c_str(), "GetTimeSeconds") &&
			!strstr(FunctionName.c_str(), "ServerUpdateLevelVisibility") &&
			!strstr(FunctionName.c_str(), "UpdatePlayerPositionsWithinTheMID") &&
			!strstr(FunctionName.c_str(), "ExecuteUbergraph_BGA_Petrol_Pickup"))
		{
			logFile << "ProcessEvent: " << FunctionName << std::endl;
		}
	}

	return ProcessEventOG(Obj, Function, Params);
}

inline bool IsInFrontend()
{
	if (auto World = UWorld::GetWorld())
	{
		if (World->GetFName().ToString().ToString().contains("Frontend"))
		{
			return true;
		}
	}
}

DefHookOg(void, AFortAthenaMutatorOnSafeZoneUpdated, AFortAthenaMutator_Bots* Bots);
void AFortAthenaMutatorOnSafeZoneUpdated(AFortAthenaMutator_Bots* a1)
{
	AFortAthenaMutatorOnSafeZoneUpdatedOG(a1);
	((void(*)(AFortAthenaMutator_Bots*))(IMAGEBASE + 0x1A9FF90))(a1);
}

DefHookOg(void, InitializeMMRInfos, AFortAthenaMutator_Bots* a1);
void InitializeMMRInfos(AFortAthenaMutator_Bots* a1)
{
	UBotELOSpawningInfo* PhoebeMMRInfo = (UBotELOSpawningInfo*)UBotELOSpawningInfo::GetDefaultObj();
	PhoebeMMRInfo->SetCachedGameMode(UWorld::GetWorld()->GetAuthorityGameMode());
	PhoebeMMRInfo->SetNumItemsToSpawn(FScalableFloat(10.0f));
	PhoebeMMRInfo->SetBotSpawningDataInfo(Runtime::StaticLoadObject<UFortAthenaMutator_PlayerBotSpawningPolicyData>("/Game/Athena/AI/Phoebe/BP_PhoebeSpawningItemData.BP_PhoebeSpawningItemData_C"));
	a1->GetCachedMMRSpawningInfo().ELOSpawningInfos.Add(PhoebeMMRInfo);

	*(int32*)(IMAGEBASE + 0x78B2F68) = 6700;
	*(int32*)(IMAGEBASE + 0x78B2F64) = 70;
	*(int32*)(IMAGEBASE + 0x78B2F6C) = 70;

	return InitializeMMRInfosOG(a1);
}

struct alignas(0x10) FPlane final : public FVector
{
	public:
	float                                         W;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

struct FBspNode // 62 bytes
{
	enum {MAX_NODE_VERTICES=255};	// Max vertices in a Bsp node.
	enum {MAX_ZONES=64};			// Max zones per level.

	// Persistent information.
	FPlane		Plane;			// 16 Plane the node falls into (X, Y, Z, W).
	int32			iVertPool;		// 4  Index of first vertex in vertex pool, =iTerrain if NumVertices==0 and NF_TerrainFront.
	int32			iSurf;			// 4  Index to surface information.

	/** The index of the node's first vertex in the UModel's vertex buffer. */
	int32			iVertexIndex;

	/** The index in ULevel::ModelComponents of the UModelComponent containing this node. */
	uint16_t		ComponentIndex;

	/** The index of the node in the UModelComponent's Nodes array. */
	uint16_t		ComponentNodeIndex;

	/** The index of the element in the UModelComponent's Element array. */
	int32			ComponentElementIndex;
	union { int32 iBack; int32 iChild[1]; };
	int32 iFront;
	int32 iPlane;

	int32		iCollisionBound;// 4  Collision bound.

	uint8	iZone[2];		// 2  Visibility zone in 1=front, 0=back.
	uint8	NumVertices;	// 1  Number of vertices in node.
	uint8	NodeFlags;		// 1  Node flags.
	int32		iLeaf[2];		// 8  Leaf in back and front, INDEX_NONE=not a leaf.
};

class FVert
{
public:
	// Variables.
	int32 	pVertex;	// Index of vertex.
	int32		iSide;		// If shared, index of unique side. Otherwise INDEX_NONE.

	/** The vertex's shadow map coordinate. */
	FVector2D ShadowTexCoord;

	/** The vertex's shadow map coordinate for the backface of the node. */
	FVector2D BackfaceShadowTexCoord;
};

// 0x0060 (0x0088 - 0x0028)
class UMaterialInterface : public UObject
{
public:
	uint8 Pad_28[0x60]; // 0x0028(0x0060) Padding to match the original size
};

struct FBspSurf
{
public:

	UMaterialInterface*	Material;		// 4 Material.
	uint32				PolyFlags;		// 4 Polygon flags.
	int32					pBase;			// 4 Polygon & texture base point index (where U,V==0,0).
	int32					vNormal;		// 4 Index to polygon normal.
	int32					vTextureU;		// 4 Texture U-vector index.
	int32					vTextureV;		// 4 Texture V-vector index.
	int32					iBrushPoly;		// 4 Editor brush polygon index.
	class ABrush*				Actor;			// 4 Brush actor owning this Bsp surface.
	FPlane				Plane;			// 16 The plane this surface lies on.
	float				LightMapScale;	// 4 The number of units/lightmap texel on this surface.

	int32					iLightmassIndex;// 4 Index to the lightmass settings

	bool				bHiddenEdTemporary;	// 1 Marks whether this surface is temporarily hidden in the editor or not. Not serialized.
	bool				bHiddenEdLevel;		// 1 Marks whether this surface is hidden by the level browser or not. Not serialized.
	bool				bHiddenEdLayer;		// 1 Marks whether this surface is hidden by the layer browser or not. Not serialized.
	// Functions.
	
};

class UModel : public UObject
{
public:
	TArray<FBspNode> Nodes;   
	TArray<FVert> Verts;       
	TArray<FVector> Vectors;  
	TArray<FVector> Points;  
	TArray<FBspSurf> Surfs;    
};

// Enum Engine.ECollisionTraceFlag
// NumValues: 0x0005
enum class ECollisionTraceFlag : uint8
{
	CTF_UseDefault = 0,
	CTF_UseSimpleAndComplex = 1,
	CTF_UseSimpleAsComplex = 2,
	CTF_UseComplexAsSimple = 3,
	CTF_MAX = 4,
};

struct FBox final
{
public:
	struct FVector                                min_0;                                             // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                max_0;                                             // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IsValid;                                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

struct alignas(0x08) FKShapeElem
{
	public:
	uint8 Pad_0[0x8];			 // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float RestOffset;			 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName Name;			 // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8 Pad_14[0x4];			 // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint8 bContributeToMass : 1; // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8 Pad_19[0x17];			 // 0x0019(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

struct FKConvexElem final : public FKShapeElem
{
public:
	TArray<struct FVector> VertexData; // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32> IndexData;		   // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBox ElemBox;			   // 0x0050(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8 Pad_6C[0x4];				   // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform Transform;	   // 0x0070(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8 Pad_A0[0x10];				   // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

struct FKAggregateGeom final
{
public:
	DEFINE_MEMBER(TArray<struct FKConvexElem>, FKAggregateGeom, ConvexElems);
};

class UBodySetup : public UObject
{
public:
	DEFINE_MEMBER(FKAggregateGeom, UBodySetup, AggGeom)
	DEFINE_BOOL(UBodySetup, bDoubleSidedGeometry)
		DEFINE_BOOL(UBodySetup, bGenerateMirroredCollision)
		DEFINE_MEMBER(ECollisionTraceFlag, UBodySetup, CollisionTraceFlag)
		DECLARE_STATIC_CLASS(UBodySetup)
	DECLARE_DEFAULT_OBJECT(UBodySetup)
};

class UBrushComponent : public AActor
{
public:
	DEFINE_PTR(UBodySetup, UBrushComponent, BrushBodySetup)
		DEFINE_PTR(UModel, UBrushComponent, Brush)
public:
	DECLARE_STATIC_CLASS(UBrushComponent)
	DECLARE_DEFAULT_OBJECT(UBrushComponent)
};

class ABrush : public AActor
{
public:
	DEFINE_PTR(UModel, UBrushComponent, Brush)
		DEFINE_PTR(UBrushComponent, ABrush, BrushComponent)
public:
	DECLARE_STATIC_CLASS(ABrush)
	DECLARE_DEFAULT_OBJECT(ABrush)
};

